{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Abuse",
    "1": "Arrest",
    "10": "Shooting",
    "11": "Shoplifting",
    "12": "Stealing",
    "13": "Vandalism",
    "2": "Arson",
    "3": "Assault",
    "4": "Burglary",
    "5": "Explosion",
    "6": "Fighting",
    "7": "NormalVideos",
    "8": "RoadAccidents",
    "9": "Robbery"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Abuse": "0",
    "Arrest": "1",
    "Arson": "2",
    "Assault": "3",
    "Burglary": "4",
    "Explosion": "5",
    "Fighting": "6",
    "NormalVideos": "7",
    "RoadAccidents": "8",
    "Robbery": "9",
    "Shooting": "10",
    "Shoplifting": "11",
    "Stealing": "12",
    "Vandalism": "13"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.21.1"
}
